In [27]:
import pyodbc
with open("db_connection.txt", "r") as f:
    conn_str = f.read()
conn = pyodbc.connect(conn_str)

print("Connected to SQL Server successfully!")

Connected to SQL Server successfully!

In [28]:
cursor = conn.cursor()

# cursor.execute("SELECT TABLE_NAME FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE = 'BASE TABLE'")
# tables = cursor.fetchall()

# for table in tables:
#     print(table[0])

In [29]:
# pip install import_ipynb

In [30]:
import import_ipynb
import NLtoSQL
import pandas as pd

In [36]:
def exe_sql(prompt):
    try:
        sql_query = NLtoSQL.generate_sql(prompt)
        print("\nGenerated SQL Query:\n", sql_query)
        cursor.execute(sql_query)
        results = cursor.fetchall()
        
#         print("\nRaw Query Results:")
#         for row in results:
#             print(row)
            
        columns = [column[0] for column in cursor.description]
#         print(columns)

#         df = pd.DataFrame(results, columns=columns)
        df = pd.DataFrame.from_records(results, columns=columns)
#         print("\nDataFrame Shape:", df.shape)
#         print("\nDataFrame Preview:\n", df.head()) 

        return df

    except Exception as e:
        return f"Error executing query: {str(e)}"

In [37]:
prompt = input("\nEnter your query in natural language: ")
query_results = exe_sql(prompt)

if isinstance(query_results, pd.DataFrame):
    print("\nQuery Results:")
    display(query_results)
else:
    print(query_results)

Enter your query in natural language: Display top 10 product id, producct name and sum of their total sales

Generated SQL Query:
 SELECT TOP 10 p.Product_ID, p.Product_Name, SUM(s.Units) AS Total_Sales
FROM products p
JOIN sales s ON p.Product_ID = s.Product_ID
GROUP BY p.Product_ID, p.Product_Name
ORDER BY Total_Sales DESC;

Query Results:

   Product_ID     Product_Name  Total_Sales
0           6        Colorbuds       104368
1          25      PlayDoh Can       103128
2           3  Barrel O' Slime        91663
3           8    Deck Of Cards        84034
4          19       Magic Sand        60598
5          31     Splash Balls        60248
6          18      Lego Bricks        59737
7           1    Action Figure        57958
8          30     Rubik's Cube        45672
9           2   Animal Figures        39089